  //filterData.js 这个文件设定屏蔽方案的数据，物品价值备列的数据等
  
//屏蔽方案的设定

//wing方案
let planWingStr="gpl;opl;gpm;opm;gps;ops;tsc;isc;vps;rvs;wms;Key;key;hp1;hp2;hp3;hp4;mp1;mp2;mp3;mp4;";
let planWingKeys = planWingStr.split(";");
banPlans.push({
  label:'[wing]常规垃圾屏蔽',
  value:'wingStd',
  keys:planWingKeys
})

  //dfcn标准屏蔽方案（保留大蓝，回城，辨识，箭袋），由IMPK阿呆整理
  let planDfcnStdManaStr =
  "cap;skp;hlm;fhl;ghm;crn;msk;qui;lea;hla;"
  + "rng;scl;chn;brs;spl;plt;fld;gth;ful;aar;"
  + "ltp;buc;sml;lrg;kit;tow;gts;vbl;mbl;bhm;"
  + "bsh;spk;hax;axe;mpi;wax;lax;bax;btx;gax;"
  + "gix;wnd;ywn;clb;scp;gsc;spc;mac;mst;whm;"
  + "mau;gma;ssd;scm;sbr;flc;bsd;lsd;wsd;2hs;"
  + "clm;gis;bsw;flb;gsd;dgr;dir;kri;bld;tkf;"
  + "tax;bkf;bal;jav;ssp;glv;spr;tri;brn;spt;"
  + "pik;bar;vou;pax;wsc;sst;lst;cst;bst;wst;"
  + "sbw;hbw;cbw;sbb;lbb;swb;lwb;lxb;mxb;hxb;"
  + "rxb;xpk;xts;xow;xit;xrg;xml;xuc;xth;xld;"
  + "xcl;xng;xtu;xla;xui;xlm;8rx;8mx;8lx;8sw;"
  + "8l8;8s8;8cb;8lb;8hb;8sb;8ws;8bs;8cs;8ls;"
  + "8ss;9wc;9h9;9pa;9s8;9vo;9b7;9p9;9br;9sr;"
  + "9gl;9s9;9ja;9bk;9ta;9tk;9kr;9di;9dg;9gd;"
  + "9gs;9cm;92h;9wd;9ls;9cr;9sb;9ss;9gm;9m9;"
  + "9wh;9fl;9ma;9sp;9qs;9sc;9cl;9gi;9ga;9bt;"
  + "9ba;9la;9wa;9mp;92a;9ax;9ha;9b9;gpl;opl;"
  + "gpm;opm;gps;ops;vps;wms;cqv;Key;key;hp1;"
  + "hp2;hp3;hp4;mp1;mp2;mp3;mp4;9bl;am1;am2;"
  + "am3;am4;am5;am6;am7;am8;am9;pa1;pa2;pa3;"
  + "pa4;pa5;9b8;";
let planDfcnStdManaKeys = planDfcnStdManaStr.split(";");

banPlans.push({
    label:'[dfcn]老手屏蔽保留蓝回辨箭(已过时)',
    value:'dfcnKeepMana',
    keys:planDfcnStdManaKeys
  })

let planDfcnStdOtherStr = "tsc;isc;aqv;mp5;"   //这里是标准屏蔽比打开大蓝多屏蔽的部分，即大蓝等
let planDfcnStdStr = planDfcnStdManaStr + planDfcnStdOtherStr;
let planDfcnStdKeys = planDfcnStdStr.split(";");
banPlans.push({
  label:'[dfcn]老手屏蔽(已过时)',
  value:'dfcnStd',
  keys:planDfcnStdKeys
})

//注意价值，暗金，套装信息是没有颜色代码等转换的,统一设为暗金或者套装绿色
//价值信息的设定,由IMPK大佬阿呆整理
let impkValuableKeys = {
    'xap': '牛魔王套', 'uap': '绿帽子', 'xkp': '岩石制动器',
    'ukp': '精英级', 'ulm': '精英级', 'xhl': '沙撒璧套',
    'uhl': '精英级', 'xhm': '女神头', 'uhm': '冰头',
    'xrn': '盗贼头', 'urn': '年纪头', 'xsk': '塔拉夏套',
    'usk': '安头', 'xh9': '物免盔', 'uh9': '塔格奥套',
    'ci0': 'rare', 'ci1': 'rare', 'ci2': 'rare',
    'ci3': '格力风之眼', 'uui': '奥马斯长袍', 'xea': '蛇皮',
    'uea': '底材', 'ula': '底材', 'stu': '牛魔王套',
    'utu': '斗士的禍根', 'ung': '底材', 'ucl': '娜塔亚套',
    'xhn': '物免甲', 'uhn': '底材', 'xrs': '督瑞尔的壳',
    'urs': '底材', 'xpl': '诗寇蒂的愤怒', 'upl': '底材',
    'xlt': '守护天使', 'ult': '底材', 'uld': '海王利维亚桑',
    'uth': '底材', 'xul': '塔格奥套', 'uul': '底材',
    'xar': '格瑞斯华尔德套', 'uar': '底材', 'xtp': '魁黑刚的智慧',
    'utp': '底材', 'uuc': '精英级', 'uml': '精英级', 'urg': '精英级',
    'uit': '暴风之盾', 'uow': '精英级', 'uts': '精英级',
    'xsh': '警戒之墙', 'ush': '精英级', 'upk': '精英级',
    'lgl': 'rare', 'xlg': 'rare', 'ulg': '安手', 'vgl': 'rare',
    'xvg': '合成材料', 'uvg': '卓古拉', 'mgl': '幸运守护',
    'xmg': '合成材料', 'umg': '合成材料', 'tgl': '法师之拳',
    'xtg': '马维娜套', 'utg': 'rare', 'hgl': '霜燃', 'xhg': '不朽之王',
    'uhg': '碎钢', 'lbt': 'rare', 'xlb': '地狱阔步', 'ulb': 'rare',
    'vbt': '牛魔王套', 'xvb': '水上漂', 'uvb': '沙暴之旅',
    'mbt': 'rare', 'xmb': '纱织', 'umb': '骨髓行走', 'tbt': '妖精脚趾',
    'xtb': '战争之旅', 'utb': 'rare', 'hbt': 'rare', 'xhb': '蚀肉骑士',
    'uhb': 'rare', 'lbl': '死神套', 'zlb': '09物免腰带',
    'ulc': '技能腰带', 'zvb': '穿刺腰带', 'uvc': '吸血圣王之圈',
    'zmb': '塔拉夏套', 'umc': '10物免腰带', 'tbl': '金色包袱',
    'ztb': '雪之冲突', 'utc': '塔格奥套', 'hbl': 'rare', 'zhb': '雷神之力',
    'uhc': '精英级', 'dr1': 'dru头', 'dr6': 'dru头', 'drb': '精英级',
    'dr2': 'dru头', 'dr7': 'dru头', 'drc': '精英级', 'dr3': 'dru头',
    'dr8': '艾尔多套', 'drd': '精英级', 'dr4': 'dru头', 'dr9': 'dru头',
    'dre': 'dru头', 'dr5': 'dru头', 'dra': '加尔的长发', 'drf': '精英级',
    'ba1': 'bar头', 'ba6': 'bar头', 'bab': 'bar头', 'ba2': 'bar头',
    'ba7': 'bar头', 'bac': '变狼头', 'ba3': 'bar头', 'ba8': 'bar头',
    'bad': 'bar头', 'ba4': 'bar头', 'ba9': 'bar头', 'bae': 'bar头',
    'ba5': '不朽之王套', 'baa': 'bbface', 'baf': '精英级',
    'pab': '底材', 'pac': '底材', 'pad': '底材', 'pa9': '撒卡蘭姆使者',
    'pae': '底材', 'paa': '底材', 'paf': '底材', 'ne1': 'rare',
    'ne6': 'rare', 'neb': 'rare', 'ne2': 'rare', 'ne7': 'rare',
    'nec': 'rare', 'ne3': 'rare', 'ne8': 'rare', 'ned': 'rare',
    'ne4': 'rare', 'ne9': '塔格奥套', 'nee': '女妖', 'ne5': 'rare',
    'nea': '侏儒', 'nef': '血王之骨', '7ha': '精英级', '7ax': '精英级',
    '72a': '精英级', '7mp': '精英级', '7wa': '底材', '7la': '精英级',
    '7ba': '精英级', '7bt': '精英级', '7ga': '精英级', '7gi': '精英级',
    '7cl': '精英级', '7sp': '精英级', '7ma': '精英级', '9mt': '艾尔多套',
    '7mt': '精英级', 'fla': '底材', '7fl': '暴风之结', '7wh': '精英级',
    '7m7': '不朽之王', '7gm': '精英级', '7ss': '精英级', '9sm': '冰刚之眼',
    '7sm': '精英级', '7sb': '精英级', '9fc': 'ALI88', '7fc': '精英级',
    'crs': '底材', '7cr': '底材', '9bs': '擊頭者', '7bs': '精英级',
    '7ls': '精英级', '7wd': '布尔凯锁套', '72h': '精英级', '7cm': '精英级',
    '7gs': '精英级', '7b7': '冠軍之劍', '9fb': '底材', '7fb': '底材',
    '7gd': '祖父', '7dg': '小刀', '7di': '精英级', '7kr': '精英级', '7bl': '精英级',
    '7tk': '精英级', '7ta': '精英级', '7bk': '精英级', '7b8': '精英级',
    '7ja': '精英级', 'pil': '3BO', '7pi': '精英级', '7s7': '精英级',
    '7gl': '鬼魂尖枪', 'tsp': '3BO', '7ts': '精英级', '7sr': '爱里欧克之针',
    '9tr': '减速X', '7tr': '精英级', '7br': '精英级', '9st': '宏森丹',
    '7st': '底材', '7p7': '底材', '7o7': '破骨', '7vo': '底材', '7s8': '死神的丧钟',
    '7pa': '盗墓者', 'hal': '烦恼诗集', '7h7': '底材', '7wc': '底材',
    '6sb': '精英级', '6hb': '精英级', 'lbw': '鸟弓', '6lb': '底材', '6cb': '底材',
    '6s7': '精英级', '6l7': '精英级', '6sw': '弑夫刃', '8lw': '金擊圓弧',
    '6lw': '风之力', '6lx': '精英级', '6mx': '精英级', '8hx': '大炮', '6hx': '精英级',
    '6rx': '精英级', '6ss': '精英级', '6ls': '精英级', '6cs': 'TP仗', '6bs': '精英级',
    '6ws': '梅格之歌的教训', '9wn': 'rare', '7wn': 'rare', '9yw': 'rare',
    '7yw': 'rare', 'bwn': '底材', '9bw': '李奥瑞克王', '7bw': '巫妖',
    'gwn': '底材', '9gw': 'rare', '7gw': '死亡之网', '7sc': '天堂之光',
    '7qs': '精英级', 'wsp': '底材', '9ws': '底材', '7ws': '底材',
    'ktr': '冷静/AR爪', '9ar': '冷静/AR爪', '7ar': '底材', 'wrb': '冷静/AR爪',
    '9wb': '冷静/AR爪', '7wb': '精英级', 'axf': '冷静/AR爪', '9xf': '冷静/AR爪',
    '7xf': '精英级', 'ces': '冷静/AR爪', '9cs': '冷静/AR爪', '7cs': '精英级',
    'clw': '冷静/AR爪', '9lw': '冷静/AR爪', '7lw': '精英级', 'btl': '冷静/AR爪',
    '9tw': '巴特克的猛击', '7tw': '底材', 'skr': '冷静/AR爪', '9qr': '冷静/AR爪',
    '7qr': '娜塔亚套', 'ob1': '电棒', 'ob6': '电棒', 'obb': '电棒', 'ob2': '电棒',
    'ob7': '电棒', 'obc': '脾气', 'ob3': '电棒', 'ob8': '电棒', 'obd': '电棒',
    'ob4': '电棒', 'ob9': '电棒', 'obe': '电棒', 'ob5': '电棒', 'oba': '眼球',
    'obf': '死亡深度', 'amb': '底材', 'amc': '底材', 'amd': '精英级',
    'ame': '精英级', 'ama': '泰坦的复仇', 'amf': '精英级', '2ax': '底材', 'scy': '底材',
    'gld': '金币'

}
//添加价值信息：这里是个合并的例子，如果自己想额外添加
let myValuableKeys={}
for(let key in myValuableKeys){
    let value = myValuableKeys[key];
    //已有内容加空格合并
    if(null!=impkValuableKeys[key]){
        impkValuableKeys[key]+=' '+value;
    }else{
        impkValuableKeys[key]=value;
    }
}

valuableKeys= impkValuableKeys;
//地材对应暗金信息和套装信息，由IMPK '新注册用户名' 提供
baseUniKeys={
    'cap':'毕格因的软帽', 'xap':'粗野之冠', 'uap':'谐角之冠',
    'skp':'塔因头盔', 'xkp':'岩石制动器', 'hlm':'光荣布帽',
    'xlm':'偷取骷髅', 'ulm':'钢影', 'fhl':'黃昏深处',
    'xhl':'暗视之盔', 'ghm':'怒号长牙', 'xhm':'女神之翼',
    'uhm':'夜翼面纱,钢铁面紗', 'crn':'不死皇冠', 'xrn':'盗贼皇冠',
    'urn':'年纪之冠', 'msk':'恐惧之脸', 'xsk':'黑角面具',
    'usk':'安达利尔的面貌', 'bhm':'温暖骷髅', 'xh9':'吸血鬼的凝视',
    'uh9':'巨骷髅', 'ci2':'奇拉的守护', 'ci3':'格利风之眼',
    'qui':'薄暮外观', 'xui':'灵魂帷幕', 'uui':'奥马斯的长袍',
    'lea':'眨眼蝙蝠的外观', 'xea':'蛇魔法师之皮', 'hla':'百夫长',
    'xla':'剝皮者之皮', 'stu':'抽动的挣扎', 'xtu':'掷铁',
    'utu':'斗士的祸根', 'rng':'扩撒黑暗', 'xng':'灵魂熔炉',
    'scl':'鹰甲', 'xcl':'鸦鸣', 'chn':'火花之甲',
    'xhn':'谢夫特斯坦布', 'brs':'毒液牢房', 'xrs':'都瑞尔的壳',
    'spl':'冰雪眨眼', 'xpl':'诗寇蒂的愤怒', 'upl':'阿凯尼的荣耀',
    'plt':'骨肉', 'xlt':'守护天使', 'fld':'石之毛',
    'xld':'排齿', 'uld':'海王利维亚桑', 'gth':'作响之笼',
    'xth':'亚特玛的哭喊', 'ful':'黃金之皮', 'xul':'黑色黑帝斯',
    'uul':'钢铁铠甲', 'aar':'胜利者之丝绸', 'xar':'尸体的哀伤',
    'uar':'泰瑞尔的力量,圣堂武士的力量', 'ltp':'天堂装束', 'xtp':'魁黑刚的智慧',
    'buc':'新月小盾', 'xuc':'维斯尔坦特', 'sml':'阴影圆盘',
    'xml':'摩西祝福之环', 'uml':'黑橡树盾', 'lrg':'暴风工会',
    'xrg':'风暴追逐者', 'kit':'作响的金属', 'xit':'魔龙的非难',
    'uit':'暴风之盾', 'tow':'贝弗提的纪念', 'xow':'基尔克的圣堂',
    'uow':'美杜沙的凝视', 'gts':'囚房', 'xts':'罗达门特之球体',
    'uts':'魂系结界', 'bsh':'无眼之墙', 'xsh':'警戒之墙',
    'ush':'猎头人的荣耀', 'spk':'剑背之架', 'xpk':'长枪守卫',
    'upk':'尖刺根源', 'lgl':'柏克之手', 'xlg':'剧毒之抓',
    'vgl':'血拳', 'xvg':'墓穴的抚弄', 'uvg':'卓古拉之握',
    'mgl':'运气守护', 'xmg':'食尸鬼外皮', 'umg':'吸魂者',
    'tgl':'法师之拳', 'xtg':'熔岩角羊', 'hgl':'霜燃',
    'xhg':'地狱之嘴', 'uhg':'碎钢', 'lbt':'热靴刺',
    'xlb':'地狱阔步', 'vbt':'血脚', 'xvb':'水上飘',
    'uvb':'沙暴之旅', 'mbt':'凯松的征服', 'xmb':'纱织',
    'umb':'骨髓行走', 'tbt':'小妖精脚趾', 'xtb':'战争旅者',
    'hbt':'泪之臀', 'xhb':'蚀肉骑士', 'uhb':'影舞者',
    'lbl':'雷尼摩', 'zlb':'长串之耳', 'ulc':'蜘蛛之网',
    'vbl':'蛇索', 'zvb':'剃刀之尾', 'uvc':'吸血圣王之圈',
    'mbl':'夜烟', 'zmb':'阴影陷阱', 'umc':'维而登戈的心结',
    'tbl':'金色包袱', 'ztb':'雪之冲突', 'hbl':'锋利腰带',
    'zhb':'雷神之力', 'drb':'地狱之吻', 'drd':'灵魂看守者',
    'dre':'乌鸦之王', 'dra':'加尔的长发', 'bac':'狼嚎',
    'bad':'恶魔号角的边缘', 'bae':'海拉伯得的国度', 'baa':'亚瑞特的面容',
    'pac':'阿而玛-尼格拉', 'pa9':'撒卡兰姆使者', 'pae':'龙鳞',
    'nee':'骨焰', 'nea':'侏儒', 'nef':'魔力肇生',
    'hax':'牙齿', '9ha':'冷杀', '7ha':'刀锋边缘',
    'axe':'死亡之铲', '9ax':'屠夫之瞳', '2ax':'肩胛骨',
    '92a':'岛击', '72a':'符文大师', 'mpi':'切开骷髅',
    '9mp':'庞贝之怒', '7mp':'鹤嘴', 'wax':'火钩之伤',
    '9wa':'蛇神守护者', '7wa':'死亡之刀', 'lax':'费屈玛之斧',
    '9la':'战爵之证', 'bax':'血块之铲', '9ba':'钢铁魔咒',
    '7ba':'永恒边界', 'btx':'族长', '9bt':'暴风骑士',
    '7bt':'地狱毁灭者', 'gax':'脑袋', '9ga':'碎骨者之刃',
    '7ga':'希梅斯特的掠夺', 'gix':'巨大无比', '9gi':'牛头怪',
    '7gi':'行刑者之裁决', 'clb':'凶猛橡树', '9cl':'暗族碎灭者',
    '7cl':'诺德的蚀肉药', 'spc':'坚硬的指甲', '9sp':'血肉裁決者',
    '7sp':'恶魔爪牙', 'mac':'压碎的凸边', '9ma':'尖啸冰霜',
    'mst':'血升', '9mt':'落月', '7mt':'巴拉那之星',
    'fla':'坦-杜-里-嘎将军', '9fl':'贝西尔的漩涡', '7fl':'暴风之结,地平线的龙卷风',
    'whm':'铁石', '9wh':'撼地者', '7wh':'史恰佛之槌,碎石锤',
    'mau':'碎骨', '9m9':'血树残株', '7m7':'风之锤',
    'gma':'铁制大锤', '9gm':'痛苦木槌', '7gm':'碎脑锤,地覆',
    'ssd':'瑞克撒特的挽歌', '9ss':'血书', 'scm':'血红新月',
    '9sm':'冰刚之眼', '7sm':'迪金杀手', 'sbr':'格林提斯的肉叉',
    '9sb':'六角之火', '7sb':'血月', 'flc':'闪耀的镰刀',
    '9fc':'阿里巴巴之刃', '9cr':'金瑟的裂缝', '7cr':'光之军刀,青色愤怒',
    'bsd':'格瑞斯华尔德的锐利', '9bs':'击头者', 'lsd':'地狱瘟疫',
    '9ls':'疫病带原者', '7ls':'霜风', 'wsd':'库尔温的尖端',
    '9wd':'亚特拉斯', '2hs':'影之牙', '92h':'克林铁弗姆',
    'clm':'剥皮灵魂', '9cm':'兵之王', 'gis':'金麦尔的锥子',
    '9gs':'卑劣躯壳', '7gs':'火焰怒吼', 'bsw':'黑色之舌',
    '9b9':'云裂', '7b7':'末日毁灭者', 'flb':'粗齿大锯',
    '9fb':'特迪斯法雷芙法米', 'gsd':'族长', '9gd':'剑卫',
    '7gd':'祖父', 'dgr':'海鸥', '9dg':'裂脊者',
    '7dg':'巫师之刺', 'dir':'迪格勒', '9di':'刻心者',
    'kri':'坦杜之玉', '9kr':'黑沼之锋', '7kr':'裂肉者',
    'bld':'妖怪碎片', '9bl':'暴风尖刺', '7bl':'鬼火焰',
    '9tk':'死亡碎片', '9ta':'圆盘', '7ta':'碎片贪噬者',
    '7bk':'战争之鸟', '7b8':'撕裂者', '7s7':'魔鬼抛物线',
    '7gl':'死灵夜翔', '7ts':'石像鬼之噬', 'spr':'张龙',
    '9sr':'穿刺者', '7sr':'阿里欧克之针', 'tri':'剃刀之叉',
    '9tr':'水魔陷阱', 'brn':'血之偷', '9br':'噬魂叉',
    '7br':'腹蛇叉', 'spt':'雅该长矛', '9st':'宏森丹',
    'pik':'坦之血杖', '9p9':'荣耀的尖塔', '7p7':'铁柱',
    'bar':'迪马克之劈砍', '9b7':'刮肉者', '7o7':'破骨',
    'vou':'铁刺棒', '9vo':'黑水之刃', 'scy':'灵魂采集者',
    '9s8':'雅典娜的忿怒', '7s8':'死神的丧钟', 'pax':'战斗支系',
    '9pa':'皮尔通把考恩特', '7pa':'盗墓者', 'hal':'烦恼诗集',
    '9h9':'胡索丹依弗', 'wsc':'冷酷开膛手', '9wc':'惊怖焰亡灵',
    '7wc':'暴风尖塔', '8sb':'天击', 'hbw':'凋谢之戒',
    '8hb':'撕裂之钩', 'lbw':'渡鸟之爪', '8lb':'社角久子',
    'cbw':'萝格之弓', '8cb':'无休止的冰雹', 'sbb':'暴风之击',
    '8s8':'狂野之弦', 'lbb':'凋谢之画', '8l8':'岩壁杀手',
    '6l7':'鹰之号角', 'swb':'作响的地狱', '8sw':'巫师之怒',
    '6sw':'弑夫刃', 'lwb':'爆裂的吠叫', '8lw':'金击圆弧',
    '6lw':'风之力', 'lxb':'引导乌鸦', '8lx':'兰格布里瑟',
    'mxb':'灵液之刺', '8mx':'毒液怪', 'hxb':'投掷地狱',
    '8hx':'布理撒多凯南', '6hx':'地狱拷问', 'rxb':'毁灭投石者',
    '8rx':'恶魔机器', '6rx':'内部爆裂', 'sst':'祸根之灰',
    '8ss':'摆动剃刀', 'lst':'海蛇之王', '8ls':'肋骨粉碎者',
    'cst':'拉撒罗斯之螺旋', '8cs':'五彩的怒气', '6cs':'安戴尔的智慧',
    'bst':'火精灵', '8bs':'扭曲之矛', 'wst':'铁检棒',
    '8ws':'髅收集者', '6ws':'梅格之歌的教训', 'wnd':'衣洛的火炬',
    '9wn':'自杀支系', 'ywn':'漩涡', '9yw':'凯恩碎片',
    'bwn':'墓穴之脊', '9bw':'李奧瑞克王的武器', '7bw':'白骨阴影',
    'gwn':'乌米的恸哭', '9gw':'黑手之钥', '7gw':'死亡之网',
    'scp':'敲击丧钟者', '9sc':'撒卡兰姆之手', '7sc':'天堂之光,救世主',
    'gsc':'腐蚀的把手', '9qs':'恶臭散布者', 'wsp':'暴风眼',
    '9ws':'祝福之光之手', '7ws':'阿斯特龙之铁的保护区', '7wb':'碧玉爪',
    '7cs':'影杀者', '7lw':'火蜥蜴之爪', '9tw':'巴特克的猛击',
    'obc':'艾丝屈塔的脾气', 'oba':'眼球', 'obf':'死亡深度',
    'amb':'血乌的袭击', 'am7':'雷山德的指标', 'am8':'雷山德的侧腹',
    'ame':'石乌鸦', 'ama':'泰坦的复仇', 'amf':'雷击'
    }
   
baseSetKeys={
   'cap':'地狱,山德-头盔', 'xap':'牛魔王-头盔', 'skp':'阿卡娜-头盔',
   'hlm':'狂战士-头盔', 'fhl':'依森哈德-头盔', 'xhl':'撒沙壁-头盔',
   'ghm':'西刚-头盔', 'xhm':'孤儿-头盔', 'uhm':'天堂-头盔',
   'crn':'依雷撒,米勒柏德加-头盔', 'xrn':'华宁-头盔', 'urn':'格瑞斯华尔德-头盔',
   'msk':'卡珊-头盔', 'xsk':'塔拉夏-头盔', 'bhm':'泰克雷-头盔',
   'xh9':'娜塔亚-头盔', 'uh9':'塔格奥-头盔', 'ci0':'娜吉-头盔',
   'ci3':'马维娜-头盔', 'qui':'北极-衣服', 'uui':'门徒-衣服',
   'lea':'维达拉-衣服', 'stu':'牛魔王-衣服', 'rng':'天使-衣服',
   'xcl':'华宁-衣服', 'ucl':'娜塔亚-衣服', 'chn':'卡珊-衣服',
   'brs':'依森哈德-衣服', 'xrs':'天堂-衣服', 'spl':'狂战士-衣服',
   'upl':'撒沙壁-衣服', 'ult':'娜吉-衣服', 'uld':'马维娜-衣服',
   'gth':'西刚-衣服', 'uth':'塔拉夏-衣服', 'ful':'泰克雷-衣服',
   'xul':'塔格奥-衣服', 'uul':'艾尔多-衣服', 'aar':'米勒柏德加-衣服',
   'xar':'格瑞斯华尔德-衣服', 'uar':'不朽之王-衣服', 'ltp':'阿卡娜-衣服',
   'buc':'哈斯拉柏-盾', 'sml':'克雷德劳-盾', 'xml':'孤儿-盾',
   'lrg':'希弗伯-盾', 'kit':'米勒柏德加-盾', 'tow':'西刚-盾',
   'gts':'依森哈德-盾', 'uts':'天堂-盾', 'lgl':'死神-手套',
   'ulg':'门徒-手套', 'vgl':'山德-手套', 'xvg':'孤儿-手套',
   'mgl':'克雷德劳-手套', 'xmg':'塔格奥-手套', 'tgl':'北极,依雷撒-手套',
   'xtg':'马维娜-手套', 'hgl':'西刚-手套', 'xhg':'不朽之王-手套',
   'lbt':'泰克雷-鞋', 'xlb':'门徒-鞋', 'vbt':'牛魔王,山德-鞋',
   'mbt':'哈斯拉柏-鞋', 'xmb':'娜塔亚-鞋', 'tbt':'维达拉-鞋',
   'xtb':'艾尔多-鞋', 'hbt':'西刚-鞋', 'xhb':'不朽之王-鞋',
   'lbl':'死神-腰带', 'vbl':'北极-腰带', 'zvb':'马维娜-腰带',
   'mbl':'哈斯拉柏,华宁-腰带', 'zmb':'塔拉夏-腰带', 'umc':'门徒-腰带',
   'tbl':'地狱,依雷撒-腰带', 'ztb':'孤儿-腰带', 'utc':'塔格奥-腰带',
   'hbl':'西刚-腰带', 'zhb':'不朽之王-腰带', 'dr8':'艾尔多-头盔',
   'ba5':'不朽之王-头盔', 'paf':'格瑞斯华尔德-盾', 'ne9':'塔格奥-盾',
   '2ax':'狂战士-武器', 'mpi':'泰克雷-武器', '7ma':'天堂-武器',
   '9mt':'艾尔多-武器', '7m7':'不朽之王-武器', 'sbr':'天使-武器',
   'bsd':'依森哈德-武器', 'lsd':'克雷德劳-武器', '7ls':'撒沙壁-武器',
   'wsd':'死神-武器', '7wd':'布尔凯索-武器', '7gd':'布尔凯索-武器',
   '9vo':'华宁-武器', 'lbb':'维达拉-武器', 'swb':'北极-武器',
   '6cs':'娜吉-武器', 'bst':'卡珊-武器', 'wst':'阿卡娜-武器',
   'bwn':'山德-武器', 'gwn':'地狱-武器', 'gsc':'希弗伯-武器',
   'wsp':'米勒柏德加-武器', '7ws':'格瑞斯华尔德-武器', '7qr':'娜塔亚-武器',
   'oba':'塔拉夏-武器', 'amc':'马维娜-武器'
              }



